app/controllers/school_classes_controller.rb

  def create
    school_class = SchoolClass.create(class_params(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2018-02-21 03:11:53.490991"], ["updated_at", "2018-02-21 03:11:53.490991"]]

  def update
    school_class = SchoolClass.find(params[:id])
    SchoolClass.update(class_params(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-02-21 03:55:16.964310"], ["id", 1]]