app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-02-21 03:15:50.563618"], ["updated_at", "2018-02-21 03:15:50.563618"]]
---
  def create
    student = Student.create(student_params(:first_name, :last_name))